Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4c/include/component/component_uotghs.h
/**
 * \file
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */
#ifndef _SAM4C_UOTGHS_COMPONENT_
#define _SAM4C_UOTGHS_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR USB On-The-Go Interface */
/* ============================================================================= */
/** \addtogroup SAM4C_UOTGHS USB On-The-Go Interface */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UotghsDevdma hardware registers */
typedef struct {
  __IO uint32_t UOTGHS_DEVDMANXTDSC;  /**< \brief (UotghsDevdma Offset: 0x0) Device DMA Channel Next Descriptor Address Register */
  __IO uint32_t UOTGHS_DEVDMAADDRESS; /**< \brief (UotghsDevdma Offset: 0x4) Device DMA Channel Address Register */
  __IO uint32_t UOTGHS_DEVDMACONTROL; /**< \brief (UotghsDevdma Offset: 0x8) Device DMA Channel Control Register */
  __IO uint32_t UOTGHS_DEVDMASTATUS;  /**< \brief (UotghsDevdma Offset: 0xC) Device DMA Channel Status Register */
} UotghsDevdma;
/** \brief UotghsHstdma hardware registers */
typedef struct {
  __IO uint32_t UOTGHS_HSTDMANXTDSC;  /**< \brief (UotghsHstdma Offset: 0x0) Host DMA Channel Next Descriptor Address Register */
  __IO uint32_t UOTGHS_HSTDMAADDRESS; /**< \brief (UotghsHstdma Offset: 0x4) Host DMA Channel Address Register */
  __IO uint32_t UOTGHS_HSTDMACONTROL; /**< \brief (UotghsHstdma Offset: 0x8) Host DMA Channel Control Register */
  __IO uint32_t UOTGHS_HSTDMASTATUS;  /**< \brief (UotghsHstdma Offset: 0xC) Host DMA Channel Status Register */
} UotghsHstdma;
/** \brief Uotghs hardware registers */
#define UOTGHSDEVDMA_NUMBER 4
#define UOTGHSHSTDMA_NUMBER 4
typedef struct {
  __IO uint32_t     UOTGHS_DEVCTRL;                     /**< \brief (Uotghs Offset: 0x0000) Device General Control Register */
  __I  uint32_t     UOTGHS_DEVISR;                      /**< \brief (Uotghs Offset: 0x0004) Device Global Interrupt Status Register */
  __O  uint32_t     UOTGHS_DEVICR;                      /**< \brief (Uotghs Offset: 0x0008) Device Global Interrupt Clear Register */
  __O  uint32_t     UOTGHS_DEVIFR;                      /**< \brief (Uotghs Offset: 0x000C) Device Global Interrupt Set Register */
  __I  uint32_t     UOTGHS_DEVIMR;                      /**< \brief (Uotghs Offset: 0x0010) Device Global Interrupt Mask Register */
  __O  uint32_t     UOTGHS_DEVIDR;                      /**< \brief (Uotghs Offset: 0x0014) Device Global Interrupt Disable Register */
  __O  uint32_t     UOTGHS_DEVIER;                      /**< \brief (Uotghs Offset: 0x0018) Device Global Interrupt Enable Register */
  __IO uint32_t     UOTGHS_DEVEPT;                      /**< \brief (Uotghs Offset: 0x001C) Device Endpoint Register */
  __I  uint32_t     UOTGHS_DEVFNUM;                     /**< \brief (Uotghs Offset: 0x0020) Device Frame Number Register */
  __I  uint32_t     Reserved1[55];
  __IO uint32_t     UOTGHS_DEVEPTCFG[5];                /**< \brief (Uotghs Offset: 0x100) Device Endpoint Configuration Register (n = 0) */
  __I  uint32_t     Reserved2[7];
  __I  uint32_t     UOTGHS_DEVEPTISR[5];                /**< \brief (Uotghs Offset: 0x130) Device Endpoint Status Register (n = 0) */
  __I  uint32_t     Reserved3[7];
  __O  uint32_t     UOTGHS_DEVEPTICR[5];                /**< \brief (Uotghs Offset: 0x160) Device Endpoint Clear Register (n = 0) */
  __I  uint32_t     Reserved4[7];
  __O  uint32_t     UOTGHS_DEVEPTIFR[5];                /**< \brief (Uotghs Offset: 0x190) Device Endpoint Set Register (n = 0) */
  __I  uint32_t     Reserved5[7];
  __I  uint32_t     UOTGHS_DEVEPTIMR[5];                /**< \brief (Uotghs Offset: 0x1C0) Device Endpoint Mask Register (n = 0) */
  __I  uint32_t     Reserved6[7];
  __O  uint32_t     UOTGHS_DEVEPTIER[5];                /**< \brief (Uotghs Offset: 0x1F0) Device Endpoint Enable Register (n = 0) */
  __I  uint32_t     Reserved7[7];
  __O  uint32_t     UOTGHS_DEVEPTIDR[5];                /**< \brief (Uotghs Offset: 0x220) Device Endpoint Disable Register (n = 0) */
  __I  uint32_t     Reserved8[55];
       UotghsDevdma UOTGHS_DEVDMA[UOTGHSDEVDMA_NUMBER]; /**< \brief (Uotghs Offset: 0x310) n = 1 .. 4 */
  __I  uint32_t     Reserved9[44];
  __IO uint32_t     UOTGHS_HSTCTRL;                     /**< \brief (Uotghs Offset: 0x0400) Host General Control Register */
  __I  uint32_t     UOTGHS_HSTISR;                      /**< \brief (Uotghs Offset: 0x0404) Host Global Interrupt Status Register */
  __O  uint32_t     UOTGHS_HSTICR;                      /**< \brief (Uotghs Offset: 0x0408) Host Global Interrupt Clear Register */
  __O  uint32_t     UOTGHS_HSTIFR;                      /**< \brief (Uotghs Offset: 0x040C) Host Global Interrupt Set Register */
  __I  uint32_t     UOTGHS_HSTIMR;                      /**< \brief (Uotghs Offset: 0x0410) Host Global Interrupt Mask Register */
  __O  uint32_t     UOTGHS_HSTIDR;                      /**< \brief (Uotghs Offset: 0x0414) Host Global Interrupt Disable Register */
  __O  uint32_t     UOTGHS_HSTIER;                      /**< \brief (Uotghs Offset: 0x0418) Host Global Interrupt Enable Register */
  __IO uint32_t     UOTGHS_HSTPIP;                      /**< \brief (Uotghs Offset: 0x0041C) Host Pipe Register */
  __IO uint32_t     UOTGHS_HSTFNUM;                     /**< \brief (Uotghs Offset: 0x0420) Host Frame Number Register */
  __IO uint32_t     UOTGHS_HSTADDR1;                    /**< \brief (Uotghs Offset: 0x0424) Host Address 1 Register */
  __IO uint32_t     UOTGHS_HSTADDR2;                    /**< \brief (Uotghs Offset: 0x0428) Host Address 2 Register */
  __IO uint32_t     UOTGHS_HSTADDR3;                    /**< \brief (Uotghs Offset: 0x042C) Host Address 3 Register */
  __I  uint32_t     Reserved10[52];
  __IO uint32_t     UOTGHS_HSTPIPCFG[5];                /**< \brief (Uotghs Offset: 0x500) Host Pipe Configuration Register (n = 0) */
  __I  uint32_t     Reserved11[7];
  __I  uint32_t     UOTGHS_HSTPIPISR[5];                /**< \brief (Uotghs Offset: 0x530) Host Pipe Status Register (n = 0) */
  __I  uint32_t     Reserved12[7];
  __O  uint32_t     UOTGHS_HSTPIPICR[5];                /**< \brief (Uotghs Offset: 0x560) Host Pipe Clear Register (n = 0) */
  __I  uint32_t     Reserved13[7];
  __O  uint32_t     UOTGHS_HSTPIPIFR[5];                /**< \brief (Uotghs Offset: 0x590) Host Pipe Set Register (n = 0) */
  __I  uint32_t     Reserved14[7];
  __I  uint32_t     UOTGHS_HSTPIPIMR[5];                /**< \brief (Uotghs Offset: 0x5C0) Host Pipe Mask Register (n = 0) */
  __I  uint32_t     Reserved15[7];
  __O  uint32_t     UOTGHS_HSTPIPIER[5];                /**< \brief (Uotghs Offset: 0x5F0) Host Pipe Enable Register (n = 0) */
  __I  uint32_t     Reserved16[7];
  __O  uint32_t     UOTGHS_HSTPIPIDR[5];                /**< \brief (Uotghs Offset: 0x620) Host Pipe Disable Register (n = 0) */
  __I  uint32_t     Reserved17[7];
  __IO uint32_t     UOTGHS_HSTPIPINRQ[5];               /**< \brief (Uotghs Offset: 0x650) Host Pipe IN Request Register (n = 0) */
  __I  uint32_t     Reserved18[7];
  __IO uint32_t     UOTGHS_HSTPIPERR[5];                /**< \brief (Uotghs Offset: 0x680) Host Pipe Error Register (n = 0) */
  __I  uint32_t     Reserved19[31];
       UotghsHstdma UOTGHS_HSTDMA[UOTGHSHSTDMA_NUMBER]; /**< \brief (Uotghs Offset: 0x710) n = 1 .. 4 */
  __I  uint32_t     Reserved20[44];
  __IO uint32_t     UOTGHS_CTRL;                        /**< \brief (Uotghs Offset: 0x0800) General Control Register */
  __I  uint32_t     UOTGHS_SR;                          /**< \brief (Uotghs Offset: 0x0804) General Status Register */
  __O  uint32_t     UOTGHS_SCR;                         /**< \brief (Uotghs Offset: 0x0808) General Status Clear Register */
  __O  uint32_t     UOTGHS_SFR;                         /**< \brief (Uotghs Offset: 0x080C) General Status Set Register */
  __I  uint32_t     Reserved21[7];
  __I  uint32_t     UOTGHS_FSM;                         /**< \brief (Uotghs Offset: 0x082C) General Finite State Machine Register */
} Uotghs;
